q=int(input('скільки студентів в групі '))
w=int(input('порядковй номер '))
print(f'У моїй групі {q} студентів')
print(f'Мій порядковий номер у списку групи {w}')

w=int(input('порядковй номер '))
print(f'----------{w}')

w=int(input('порядковй номер '))
print(f'{w}----------')

q=int(input('скільки студентів в групі '))
w=int(input('порядковй номер '))
print(w/q)

q=int(input('день народження '))
w=int(input('місяць народження'))
e=int(input('рік народження'))
print(f'{q}/{w}/{e}')

print('''***********************
*  +     /\       +   *
*      /    \   +     *
*    /        \   +   *
*    +--------+       *
*   |     ---- |      *
*   |     |  | |      *
*   |     |  | |      *
* __|_____|__|_|______*
***********************''')

q=float(input('довжина кімнати в м '))
w=float(input('ширна кімнати в м '))
print(f'плоша {q*w} метрів квадратніх')


q=int(input('радіус'))
w=int(input('висота'))
print('площа циліндра',round(q*q*3.14*w,1),'метрів кубічних')
