print('#1')
q=int(input('Введіть число, у відрізок [–50;50] '))
if -50<=q<=50:
 w='належить'
else:
 w='неналежить'
print(f'Число {q} {w} діапазону [-50; 50]')
print('#2')
q=int(input('Введіть ліву межу проміжку: '))
w=int(input('Введіть праву межу проміжку: '))
e=input('Вивести інтервал, напівінтервали чи відрізок із заданими межами?')
if e=='інтервал':
 print(f'({q};{w})')
elif e=='напівінтервали':
 print(f'({q};{w}] та [{q};{w})')
elif e=='відрізок':
 print(f'[{q};{w}]')
print('#3')
q=input('Введіть номер квитка:')
w=list(q)
if len(w)==4 and w[0]+w[1]==w[2]+w[3]:
 print('Квиток #',q,'щасливий!')
elif len(w)==4 and w[0]+w[1]!=w[2]+w[3]:
 print('Квиток #',q,'нещасливий')
else:
 print('помилка')
print('#4')
q=list(input('координати клітини '))
w=['a','b','c','d','e','f','g','h']
e=['1','2','3','4','5','6','7','8']
if (w.index(q[0])+e.index(q[1]))%2==0:
 print('чорна')
else:
 print('біла')
print('#5*')
import random
q=input('Номер: ')
e=['0','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','00']
w=random.randint (0,len(e))
if w=='0' or w=='00':
    print('Номер, що випав: ',w)
    print('Ставка, що виграла: ',w)
    print('Ставка, що виграла: зелене')
else:
    print('Виграла ставка: ',w)
    w=int(w)
    if w==1 or w==3 or w==5 or w==7 or w==9 or w==12 or w==14 or w==16 or w==18 or w==19 or w==21 or w==23 or w==25 or w==27 or w==30 or w==32 or w==34 or w==36:
        print("Виграла ставка: червоне ")
    else:
        print('Виграла ставка: чорне ')
    if w%2==0:
        print('Виграла ставка: парнe')
    else:
        print('Виграла ставка: непарне')
    if w<19:
        print('Виграла ставка: від 1 до 18')
    else:
        print('Виграла ставка: від 19 до 36')
